Tekla.Structures.Drawing.SizeDefinitionMode
Controls the size definition mode of the drawing sheet. Set the mode to
SizeDefinitionMode.SpecifiedSize if you want to force the sheet to a
certain size.
Tekla.Structures.Drawing.AutoSizeOptions
Tekla.Structures.Drawing.LayoutAttributes